# Technical Evaluation

### Dataset: Plan Crashes

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

## Bad Data Discovery

In [2]:
#Read Data
data = pd.read_csv('plane_crashes_data.csv')
data.head()

,month,hour,year,location,operator,route,type,aboard,fatalities,summary
0,1,12,1950,"Near Vacas, Bolivia",Military - Bolivian Air Force,Valle grande - Cochabamba,Douglas C-47,32,32,Crashed while en route in the Andes mountains ...
1,3,20,1950,"Minneapolis, Minnesota",Northwest Orient Airlines,Rochester Minn. - Minneapolis,Martin 202,13,13,"Crashed into a flag pole, well marked by red n..."
2,3,14,1950,"Llandow Airport, Cardiff, Wales",Fairflight Ltd.,Llandow - Dublin,Avro 689 Tudor 5,83,80,During the approach to Runway 28 at Llandow Ai...
3,4,23,1950,"Near Atsugi, Japan",Military - U.S. Air Force,Philippines - Japan,Douglas C-54D,35,35,Flew off its prescribed course and crashed int...
4,5,20,1950,"Lagens Air Force Base, Azores",Military - U.S. Air Force,Bermuda - England,Boeing B-29,16,16,Crashed while attempting to land after being d...

In [37]:
((1/50)*(1/49)*(1/48)*(1/47)*(1/25))**-1

138180000.00000003

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2709 entries, 0 to 2708
Data columns (total 10 columns):
month         2709 non-null int64
hour          2709 non-null object
year          2709 non-null int64
location      2706 non-null object
operator      2707 non-null object
route         2318 non-null object
type          2708 non-null object
aboard        2709 non-null int64
fatalities    2709 non-null int64
summary       2696 non-null object
dtypes: int64(4), object(6)
memory usage: 211.7+ KB

In [28]:
#Mean Number of people killed in plan crashes for the years 1980 to 2009
data[data['year']>=1980]['fatalities'].mean()

24.932607215793055

In [18]:
#Month has the most plan crashes
data.groupby('month').count().

,hour,year,location,operator,route,type,aboard,fatalities,summary
month,,,,,,,,,
1,255,255,255,255,220,255,255,255,252
2,209,209,208,209,180,209,209,209,209
3,251,251,250,250,208,251,251,251,250
4,204,204,204,204,163,203,204,204,204
5,181,181,180,181,158,181,181,181,179
6,202,202,202,202,174,202,202,202,200
7,234,234,234,234,202,234,234,234,234
8,239,239,239,239,211,239,239,239,238
9,228,228,228,228,200,228,228,228,228
10,224,224,224,223,186,224,224,224,224
11,230,230,230,230,196,230,230,230,229
12,252,252,252,252,220,252,252,252,249

In [19]:
#Highest number of fatalities in a single crash?
data['fatalities'].max()

583

In [23]:
#% of crashed flights that had 1 or more fatalities
(data[data['fatalities']>=1].count()['year'])/(data['fatalities'].count())

0.98191214470284238

In [25]:
#What is the average percent of passengers killed per plan crash
(data['fatalities']/data['aboard']).mean()

0.8231319223510563

In [52]:
#Note the bad inputs on the hour column
data['hour'].value_counts()

19         169
9          166
11         159
15         159
14         153
12         150
16         146
13         145
10         142
17         138
18         136
8          131
20         131
7          117
21          94
23          93
22          93
6           75
2           58
0           55
1           55
4           50
5           49
3           39
c14:30       1
12'20        1
c16:50       1
c:09:00      1
22'08        1
c: 9:40      1
Name: hour, dtype: int64

In [9]:
bad_hour_list = data[(data['hour']=='c14:30')
                         |(data['hour']=="12'20")
                         |(data['hour']=="c16:50")
                         |(data['hour']=="c:09:00")
                         |(data['hour']=="22'08")
                         |(data['hour']=="c: 9:40")].index.values.tolist()

In [53]:
#This filter will return the bad rows
data[(data['hour']=='c14:30')
     |(data['hour']=="12'20")
     |(data['hour']=="c16:50")
    |(data['hour']=="c:09:00")
    |(data['hour']=="22'08")
    |(data['hour']=="c: 9:40")]

,month,hour,year,location,operator,route,type,aboard,fatalities,summary
205,1,c16:50,1957,"Ometepe Island, Nicaragua",Lanica,San Carlos - Managua,Douglas DC-3,16,16,The aircraft hit Concepcion volcano while en r...
345,1,12'20,1961,"Off Montauk Point, New York",American Airlines,Training,Boeing 707-123,6,6,Crashed into the AtlantiOcean and exploded.
904,10,c:09:00,1972,"Off Athens, Greece",OlympiAirways,Kerkira - Athens,NAMC YS-11A-202,53,37,Crashed into the sea just short of the runway ...
1345,12,c14:30,1982,"Near San Andres de Bocay, Nicaragua",Military - Nicaraguan Air Force,NaN,Mil Mi-8 (helicopter),88,84,Shot down by Sandinistan rebels.
2306,12,22'08,2001,"Zurich, Switzerland",Eagle Air,NaN,Cessna 560 Citation V,2,2,After reaching a height of 500 ft. the aircraf...
2314,1,c: 9:40,2002,"Near Milford Sound, New Zealand",Air Fiordland,Te Anau - Milford Sound,Cessna 207 Skywagon,6,6,The sightseeing plane hit a mountainside at a...

In [3]:
#Notice Summary, route, location, operator, and type has some null objects.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2709 entries, 0 to 2708
Data columns (total 10 columns):
month         2709 non-null int64
hour          2709 non-null object
year          2709 non-null int64
location      2706 non-null object
operator      2707 non-null object
route         2318 non-null object
type          2708 non-null object
aboard        2709 non-null int64
fatalities    2709 non-null int64
summary       2696 non-null object
dtypes: int64(4), object(6)
memory usage: 211.7+ KB

Will need to clean up the datset before we can use it.
To clean up I will:

1. Remove the bad hours
2. Remove all of the null objects
3. Turn the 3 separate columns (Hour, Month, Year) into a single date time column and turn that into an index.

## Clean Up

In [13]:
#Create a new dataframe
df = pd.read_csv('plane_crashes_data.csv', parse_dates=[['hour','month','year']] )

#Decided to drop the data to deal with the bad hours. These are the indexes of the bad hours.
#df.drop([205,345,904,1345,2306,2314], inplace=True)
df.drop(bad_hour_list, inplace=True)
df.head()

,hour_month_year,location,operator,route,type,aboard,fatalities,summary
0,12 1 1950,"Near Vacas, Bolivia",Military - Bolivian Air Force,Valle grande - Cochabamba,Douglas C-47,32,32,Crashed while en route in the Andes mountains ...
1,20 3 1950,"Minneapolis, Minnesota",Northwest Orient Airlines,Rochester Minn. - Minneapolis,Martin 202,13,13,"Crashed into a flag pole, well marked by red n..."
2,14 3 1950,"Llandow Airport, Cardiff, Wales",Fairflight Ltd.,Llandow - Dublin,Avro 689 Tudor 5,83,80,During the approach to Runway 28 at Llandow Ai...
3,23 4 1950,"Near Atsugi, Japan",Military - U.S. Air Force,Philippines - Japan,Douglas C-54D,35,35,Flew off its prescribed course and crashed int...
4,20 5 1950,"Lagens Air Force Base, Azores",Military - U.S. Air Force,Bermuda - England,Boeing B-29,16,16,Crashed while attempting to land after being d...

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2703 entries, 0 to 2708
Data columns (total 8 columns):
hour_month_year    2703 non-null object
location           2700 non-null object
operator           2701 non-null object
route              2314 non-null object
type               2702 non-null object
aboard             2703 non-null int64
fatalities         2703 non-null int64
summary            2690 non-null object
dtypes: int64(2), object(6)
memory usage: 190.1+ KB

In [18]:
df.dropna(inplace=True)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2300 entries, 0 to 2708
Data columns (total 8 columns):
hour_month_year    2300 non-null object
location           2300 non-null object
operator           2300 non-null object
route              2300 non-null object
type               2300 non-null object
aboard             2300 non-null int64
fatalities         2300 non-null int64
summary            2300 non-null object
dtypes: int64(2), object(6)
memory usage: 161.7+ KB

In [36]:
df = pd.read_csv('plane_crashes_data.csv', parse_dates=[['hour','month','year']] )

In [37]:
#Goal: I would like to combine the month, hour and year columns, turn it into a datetime, and then turn to index
df['timestamp'] = pd.to_datetime(df['hour_month_year'], format= "%H %m %Y", errors='coerce')

,hour_month_year,location,operator,route,type,aboard,fatalities,summary,timestamp
0,12 1 1950,"Near Vacas, Bolivia",Military - Bolivian Air Force,Valle grande - Cochabamba,Douglas C-47,32,32,Crashed while en route in the Andes mountains ...,1950-01-01 12:00:00
1,20 3 1950,"Minneapolis, Minnesota",Northwest Orient Airlines,Rochester Minn. - Minneapolis,Martin 202,13,13,"Crashed into a flag pole, well marked by red n...",1950-03-01 20:00:00
2,14 3 1950,"Llandow Airport, Cardiff, Wales",Fairflight Ltd.,Llandow - Dublin,Avro 689 Tudor 5,83,80,During the approach to Runway 28 at Llandow Ai...,1950-03-01 14:00:00
3,23 4 1950,"Near Atsugi, Japan",Military - U.S. Air Force,Philippines - Japan,Douglas C-54D,35,35,Flew off its prescribed course and crashed int...,1950-04-01 23:00:00
4,20 5 1950,"Lagens Air Force Base, Azores",Military - U.S. Air Force,Bermuda - England,Boeing B-29,16,16,Crashed while attempting to land after being d...,1950-05-01 20:00:00

In [39]:
df.set_index('timestamp', inplace=True)
df.head()

,hour_month_year,location,operator,route,type,aboard,fatalities,summary
timestamp,,,,,,,,
1950-01-01 12:00:00,12 1 1950,"Near Vacas, Bolivia",Military - Bolivian Air Force,Valle grande - Cochabamba,Douglas C-47,32,32,Crashed while en route in the Andes mountains ...
1950-03-01 20:00:00,20 3 1950,"Minneapolis, Minnesota",Northwest Orient Airlines,Rochester Minn. - Minneapolis,Martin 202,13,13,"Crashed into a flag pole, well marked by red n..."
1950-03-01 14:00:00,14 3 1950,"Llandow Airport, Cardiff, Wales",Fairflight Ltd.,Llandow - Dublin,Avro 689 Tudor 5,83,80,During the approach to Runway 28 at Llandow Ai...
1950-04-01 23:00:00,23 4 1950,"Near Atsugi, Japan",Military - U.S. Air Force,Philippines - Japan,Douglas C-54D,35,35,Flew off its prescribed course and crashed int...
1950-05-01 20:00:00,20 5 1950,"Lagens Air Force Base, Azores",Military - U.S. Air Force,Bermuda - England,Boeing B-29,16,16,Crashed while attempting to land after being d...

## Cleaned Up Data